brew "cmake"
brew "gawk"
brew "libarchive"
brew "libnfs"
brew "libssh"
brew "neon"
brew "ninja"
brew "openssl"
brew "pcre"
brew "pkg-config"
brew "spdlog"
brew "uchardet"
brew "wget"
brew "wxmac"
brew "mercurial"
brew "xerces-c"
